Data/TU_Delft_Campus_case/c_1/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 4.97 0 );

boundaryField
{
    x0
    {
        type            symmetry;
    }
    y0
    {
        type            atmBoundaryLayerInletVelocity;
        z0              uniform 0.5;
        flowDir         ( 0 1 0 );
        zDir            ( 0 0 1 );
        kappa           0.41;
        Cmu             0.09;
        Uref            4.97;
        Zref            10;
        zGround         uniform 1.95;
        value           uniform ( 0 4.97 0 );
    }
    x1
    {
        type            symmetry;
    }
    y1
    {
        type            zeroGradient;
    }
    terrain
    {
        type            uniformFixedValue;
        uniformValue    constant ( 0 0 0 );
        value           uniform ( 0 0 0 );
    }
    sky
    {
        type            symmetry;
    }
    Buildings
    {
        type            uniformFixedValue;
        uniformValue    constant ( 0 0 0 );
        value           uniform ( 0 0 0 );
    }
    WaterGreen
    {
        type            uniformFixedValue;
        uniformValue    constant ( 0 0 0 );
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
