Data/TU_Delft_Campus_case/c_1/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -1 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    #include "include/ABLConditions"

    x0
    {
        type            symmetry;
    }
    y0
    {
        type            calculated;
        value           uniform 0;
    }
    x1
    {
        type            symmetry;
    }
    y1
    {
        type            calculated;
        value           uniform 0;
    }
    terrain
    {
        type            nutkAtmRoughWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        z0              uniform 0.5;
        value           uniform 0;
    }
    sky
    {
        type            symmetry;
    }
    Buildings
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0;
    }
    WaterGreen
    {
        type            nutkAtmRoughWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        z0              $z0watergreen;
        value           uniform 0;
    }
}


// ************************************************************************* //
