Data/TU_Delft_Campus_case/c_1/system/probes_cell
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

fields (p U epsilon k);

interpolationScheme cell;

probeLocations
(   
    (218.934 711.067 11.5)  //Probe 1  //terrain
    (186.442 624.647 11.5)  //Probe 2
    (52.6517 173.761 11.5)  //Probe 3
    (-299.026 652.827 11.5) //Probe 4
    (-31.4452 386.053 11.5) //Probe 5
    (-224.486 793.729 11.5) //Probe 6
    (-2.77582 175.64 11.5)  //Probe 7
    (360.37 562.65 8.75)    //Probe 8   //in front of Building 14m
    (-321.962 564.529 11.5) //Probe 9
    (-388.857 402.961 13.25) //Probe 10 //in front of Building 20m
    (-528.382 303.391 11.5) //Probe 11
    (-81.1389 186.912 11.5) //Probe 12
    (201.733 282.725 11.5)  //Probe 13
    (-132.744 201.941 11.5) //Probe 14
    (222.757 245.151 11.5)  //Probe 15
    (-450.018 393.568 11.5) //Probe 16
    (238.047 743.005 11.5)  //Probe 17
    (329.789 485.624 11.5)  //Probe 18
    (-453.841 491.26 11.5)  //Probe 19
    (-316.228 624.647 11.5) //Probe 20
    (230.402 303.391 18.5)  //Probe 21  //in front of Building 27m
    (109.99 38.4951 11.5)   //Probe 22
    (197.91 196.305 11.5)   //Probe 23 
    (-255.067 149.338 11.5) //Probe 24
    (102.345 739.247 11.5)  //Probe 25 
    (-350.631 355.994 11.5) //Probe 26
    (-647.457 442.414 11.5) //Probe 27
    (-56.292 810.637 11.5)  //Probe 28
    (280.096 893.3 11.5)    //Probe 29
    (299.209 1203.28 11.5)  //Probe 30
    (-151.857 1004.14 11.5) //Probe 31
    (52.6517 -299.41 11.5)  //Probe 32
    (-514.993 463.076 11.5) //Probe 33 
    (308.765 325.935 11.5)  //Probe 34
    (-320.051 588.952 11.5) //Probe 35
    (343.168 743.005 11.5)  //Probe 36
    (215.112 98.612 11.5)   //Probe 37
    (260.983 186.912 11.5)  //Probe 38 //water
    (-260.8 175.64 11.5)    //Probe 39 //water
    (224.675 716.719 11.5)  //Probe 40
    (343.17 318.418 11.5)   //Probe 41 
    (280.092 185.034 11.5)  //Probe 42 //green
    (20.1739 113.648 11.5)  //Probe 43 //green
    (-266.532 639.676 11.5) //Probe 44
    (201.733 664.1 11.5)    //Probe 45
    (96.6114 885.785 11.5)  //Probe 46
    (257.161 404.844 11.5)  //Probe 47
    (41.1957 153.09 11.5)   //Probe 48
    (173.063 149.338 11.5)  //Probe 49
    (-151.856 575.802 11.5) //Probe 50
    (423.443 444.293 11.5)  //Probe 51
);

// ************************************************************************* //
